Repository: yiiio226/TriTalk
Catalog: frontend/lib/l10n/intl_*.arb
Languages: de, fr

# home_greeting
source: Hi! Ready to practice?
de: Hallo! Bereit zum Üben?
fr: Salut ! Prêt à pratiquer ?

# home_dailyGoal
source: Daily Goal
de: Tagesziel
fr: Objectif Quotidien

# home_recentScenarios
source: Recent Scenarios
de: Letzte Szenarien
fr: Scénarios Récents

# home_exploreScenarios
source: Explore Scenarios
de: Szenarien erkunden
fr: Explorer Scénarios

# home_startChat
source: Start Chat
de: Chat starten
fr: Commencer Chat

# home_cancel
source: Cancel
de: Abbrechen
fr: Annuler

# chat_typeAMessage
source: Type a message...
de: Nachricht eingeben...
fr: Tapez un message...

# chat_pressToSpeak
source: Press to speak
de: Drücken zum Sprechen
fr: Appuyez pour parler

# chat_releaseToSend
source: Release to send
de: Loslassen zum Senden
fr: Relâchez pour envoyer

# chat_optimizeWithAi
source: Optimize with AI
de: Mit KI optimieren
fr: Optimiser avec IA

# chat_retry
source: Retry
de: Wiederholen
fr: Réessayer

# chat_delete
source: Delete
de: Löschen
fr: Supprimer

# profile_languageSettings
source: Language Settings
de: Spracheinstellungen
fr: Paramètres de Langue

# profile_appLanguage
source: App Language
de: App-Sprache
fr: Langue de l'App

# profile_nativeLanguage
source: Native Language
de: Muttersprache
fr: Langue Maternelle

# profile_learningLanguage
source: Learning Language
de: Lernsprache
fr: Langue d'Apprentissage

# profile_upgradeToPro
source: Upgrade to Pro
de: Auf Pro upgraden
fr: Passer à Pro

# profile_logOut
source: Log Out
de: Abmelden
fr: Déconnexion

# profile_vocabularySentencesChatHistory
source: Vocabulary, Sentences, Chat History
de: Wortschatz, Sätze, Verlauf
fr: Vocabulaire, Phrases, Historique

# common_loading
source: Loading...
de: Laden...
fr: Chargement...

# common_error
source: Error
de: Fehler
fr: Erreur

# common_success
source: Success
de: Erfolg
fr: Succès

# common_save
source: Save
de: Speichern
fr: Enregistrer

# common_confirm
source: Confirm
de: Bestätigen
fr: Confirmer

# subscription_currentTier
source: Current Plan: {tier}
de: Aktueller Plan: {tier}
fr: Plan Actuel : {tier}

# subscription_restore
source: Restore Purchases
de: Käufe wiederherstellen
fr: Restaurer les achats

# subscription_unlockPotential
source: Unlock Full Potential
de: Volles Potenzial freischalten
fr: Libérez tout le potentiel

# subscription_description
source: Get unlimited conversations, advanced grammar analysis, and access to all premium scenarios.
de: Erhalten Sie unbegrenzte Gespräche, erweiterte Grammatikanalyse und Zugriff auf alle Premium-Szenarien.
fr: Obtenez des conversations illimitées, une analyse grammaticale avancée et accès à tous les scénarios premium.

# subscription_recommended
source: POPULAR
de: BELIEBT
fr: POPULAIRE

# subscription_monthlyPlan
source: Monthly
de: Monatlich
fr: Mensuel

# subscription_yearlyPlan
source: Yearly
de: Jährlich
fr: Annuel

# subscription_purchaseSuccess
source: Subscription activated! Welcome!
de: Abo aktiviert! Willkommen!
fr: Abonnement activé ! Bienvenue !

# subscription_purchaseFailed
source: Purchase failed. Please try again.
de: Kauf fehlgeschlagen. Bitte versuchen Sie es erneut.
fr: Échec de l'achat. Veuillez réessayer.

# subscription_noPurchasesToRestore
source: No previous purchases found.
de: Keine früheren Käufe gefunden.
fr: Aucun achat précédent trouvé.

# subscription_restoreFailed
source: Failed to restore purchases. Please try again.
de: Wiederherstellung fehlgeschlagen. Bitte versuchen Sie es erneut.
fr: Échec de la restauration. Veuillez réessayer.

# subscription_noProductsAvailable
source: No products available.
de: Keine Produkte verfügbar.
fr: Aucun produit disponible.

# subscription_featureUnlimitedMessages
source: Unlimited messages
de: Unbegrenzte Nachrichten
fr: Messages illimités

# subscription_featureAdvancedFeedback
source: Advanced grammar feedback
de: Erweitertes Grammatik-Feedback
fr: Feedback grammatical avancé

# subscription_featureAllPlusFeatures
source: All Plus features included
de: Alle Plus-Funktionen enthalten
fr: Toutes les fonctions Plus incluses

# subscription_featurePremiumScenarios
source: Premium scenarios
de: Premium-Szenarien
fr: Scénarios Premium

# subscription_featurePrioritySupport
source: Priority support
de: Bevorzugter Support
fr: Support prioritaire

# chat_listen
source: Listen
de: Anhören
fr: Écouter

# chat_stop
source: Stop
de: Stopp
fr: Arrêter

# chat_perfect
source: Perfect
de: Perfekt
fr: Parfait

# chat_analyzing
source: Analyzing...
de: Analysiere...
fr: Analyse...

# chat_analyze
source: Analyze
de: Analysieren
fr: Analyser

# chat_hide_text
source: Hide Text
de: Text ausblenden
fr: Masquer le texte

# chat_text
source: Text
fr: Texte

# chat_voiceToTextLabel
source: Text
fr: Texte

# chat_shadow
source: Shadow
de: Shadowing
fr: Shadowing

# chat_translate
source: Translate
de: Übersetzen
fr: Traduire

# chat_save
source: Save
de: Speichern
fr: Enregistrer

# scenes_favorites
source: Favorites
de: Favoriten
fr: Favoris

# scenes_clearConversation
source: Clear Conversation
de: Konversation löschen
fr: Effacer la conversation

# scenes_bookmarkConversation
source: Bookmark Conversation
de: Konversation merken
fr: Marquer la conversation

# analysis_title
source: Sentence Analysis
de: Satzanalyse
fr: Analyse de Phrase

# analysis_originalSentence
source: ORIGINAL SENTENCE
de: ORIGINALSATZ
fr: PHRASE ORIGINALE

# analysis_savedToVocab
source: Saved "{word}" to Vocabulary
de: "{word}" im Wortschatz gespeichert
fr: Enregistré "{word}" dans Vocabulaire

# analysis_savedIdiom
source: Saved Idiom
de: Redewendung gespeichert
fr: Idiome enregistré

# shadowing_title
source: Shadowing Practice
de: Shadowing-Übung
fr: Pratique du Shadowing

# shadowing_holdToRecord
source: Hold to Record
de: Zum Aufnehmen halten
fr: Maintenez pour enregistrer

# shadowing_recordAgain
source: Record Again
de: Erneut aufnehmen
fr: Enregistrer à nouveau

# shadowing_complete
source: Complete
de: Abgeschlossen
fr: Terminé

# shadowing_notRated
source: Not Rated
de: Nicht bewertet
fr: Non noté

# shadowing_myScore
source: My Score
de: Mein Punktestand
fr: Mon Score

# saveNote_title
source: Quick Save
de: Schnellspeichern
fr: Sauvegarde Rapide

# saveNote_instruction
source: Tap words to select specific vocabulary, or save the entire sentence.
de: Tippen Sie auf Wörter, um Vokabeln auszuwählen, oder speichern Sie den ganzen Satz.
fr: Touchez les mots pour sélectionner du vocabulaire, ou enregistrez toute la phrase.

# saveNote_saveSentence
source: Save Entire Sentence
de: Ganzen Satz speichern
fr: Enregistrer la Phrase

# saveNote_saveSelected
source: Save Selected ({count})
de: Ausgewählte speichern ({count})
fr: Enregistrer la Sélection ({count})

# chat_suggestionsFailed
source: Failed to load suggestions: {error}
de: Vorschläge konnten nicht geladen werden: {error}
fr: Échec du chargement des suggestions : {error}

# chat_deleteConversation
source: Delete Conversation
de: Konversation löschen
fr: Supprimer la conversation

# chat_deleteConversationContent
source: Are you sure you want to delete this conversation? This will also remove it from your home screen.
de: Sind Sie sicher, dass Sie diese Konversation löschen möchten? Sie wird auch vom Startbildschirm entfernt.
fr: Voulez-vous vraiment supprimer cette conversation ? Cela la supprimera aussi de l'accueil.

# home_createScenario
source: Create Scenario
de: Szenario erstellen
fr: Créer un Scénario

# home_createScenarioDescription
source: Describe a situation you want to practice. AI will create a roleplay scenario for you.
de: Beschreiben Sie eine Situation, die Sie üben möchten. Die KI erstellt ein Rollenspiel für Sie.
fr: Décrivez une situation à pratiquer. L'IA créera un jeu de rôle pour vous.

# home_createScenarioHint
source: Example: I need to return a defective product, but the store clerk is being difficult...
de: Beispiel: Ich muss ein defektes Produkt zurückgeben, aber der Verkäufer ist schwierig...
fr: Exemple : Je dois retourner un produit défectueux mais le vendeur est difficile...

# home_generateScenario
source: Generate Scenario
de: Szenario generieren
fr: Générer Scénario

# profile_selectNative
source: Select Native Language
de: Muttersprache auswählen
fr: Sélectionner la Langue Maternelle

# profile_selectLearning
source: Select Learning Language
de: Lernsprache auswählen
fr: Sélectionner la Langue d'Apprentissage

# profile_tools
source: Tools
de: Werkzeuge
fr: Outils

# tab_vocabulary
source: Vocabulary
de: Wortschatz
fr: Vocabulaire

# tab_sentence
source: Sentence
de: Sätze
fr: Phrases

# tab_grammar
source: Grammar
de: Grammatik
fr: Grammaire

# study_noSavedSentences
source: No analyzed sentences saved yet
de: Noch keine analysierten Sätze gespeichert
fr: Aucune phrase analysée enregistrée

# profile_selectAppLanguage
source: Select App Language
de: App-Sprache auswählen
fr: Sélectionner la Langue de l'App

# profile_systemDefault
source: System Default
de: Systemstandard
fr: Défaut Système

# home_chooseScenario
source: Choose a scenario to practice {language}
de: Wählen Sie ein Szenario, um {language} zu üben
fr: Choisissez un scénario pour pratiquer le {language}

# onboarding_sessionExpiredPleaseLog
source: Session expired. Please log in again.
de: Sitzung abgelaufen. Bitte melden Sie sich erneut an.
fr: Session expirée. Veuillez vous reconnecter.

# study_summary
source: Summary
de: Zusammenfassung
fr: Résumé

# study_sentenceStructure
source: Sentence Structure
de: Satzstruktur
fr: Structure de la Phrase

# study_grammarPoints
source: Grammar Points
de: Grammatikpunkte
fr: Points de Grammaire

# study_vocabulary
source: Vocabulary
de: Wortschatz
fr: Vocabulaire

# study_idiomsSlang
source: Idioms & Slang
de: Redewendungen & Slang
fr: Idiomes et Argot

# study_analysisNotAvailable
source: Analysis not available
de: Analyse nicht verfügbar
fr: Analyse non disponible

# study_savedToNotebook
source: Saved to Notebook
de: Im Notizbuch gespeichert
fr: Enregistré dans le Carnet

# chat_conversationDeleted
source: Conversation deleted
de: Konversation gelöscht
fr: Conversation supprimée

# analysis_savedGrammarPoint
source: Saved Grammar Point
de: Grammatikpunkt gespeichert
fr: Point de Grammaire Enregistré

# lang_en_US
source: English (US)
de: Englisch (USA)
fr: Anglais (États-Unis)

# lang_en_GB
source: English (UK)
de: Englisch (UK)
fr: Anglais (Royaume-Uni)

# lang_zh_CN
source: Chinese (Simplified)
de: Chinesisch (Vereinfacht)
fr: Chinois (Simplifié)

# lang_ja_JP
source: Japanese
de: Japanisch
fr: Japonais

# lang_ko_KR
source: Korean
de: Koreanisch
fr: Coréen

# lang_es_ES
source: Spanish (Spain)
de: Spanisch (Spanien)
fr: Espagnol (Espagne)

# lang_es_MX
source: Spanish (Mexico)
de: Spanisch (Mexiko)
fr: Espagnol (Mexique)

# lang_fr_FR
source: French
de: Französisch
fr: Français

# lang_de_DE
source: German
de: Deutsch
fr: Allemand

# chat_messagesDeleted
source: {count, plural, =1{Deleted 1 message} other{Deleted {count} messages}}
de: {count, plural, =1{1 Nachricht gelöscht} other{{count} Nachrichten gelöscht}}
fr: {count, plural, =1{1 message supprimé} other{{count} messages supprimés}}

# home_sceneDeleted
source: Scene deleted
de: Szenario gelöscht
fr: Scénario supprimé

# study_example
source: Example: {text}
de: Beispiel: {text}
fr: Exemple : {text}

# home_savedToFavorites
source: Saved to Favorites
de: In Favoriten gespeichert
fr: Enregistré dans Favoris

# home_clearConversation
source: Clear Conversation
de: Konversation löschen
fr: Effacer la conversation

# home_clearConversationContent
source: Are you sure you want to clear this conversation and start over?
de: Sind Sie sicher, dass Sie diese Konversation löschen und neu beginnen möchten?
fr: Voulez-vous effacer cette conversation et recommencer ?

# home_conversationCleared
source: Conversation cleared
de: Konversation gelöscht
fr: Conversation effacée

# home_clear
source: Clear
de: Löschen
fr: Effacer

# home_noMessagesToBookmark
source: No messages to bookmark
de: Keine Nachrichten zum Merken
fr: Aucun message à marquer

# feedback_greatStatus
source: Great intonation! You sound natural.
de: Tolle Intonation! Du klingst natürlich.
fr: Super intonation ! Vous sonnez naturel.

# feedback_greatTipQuestion
source: Your question intonation is spot-on! Keep it up.
de: Deine Frage-Intonation ist genau richtig! Weiter so.
fr: Votre intonation de question est parfaite ! Continuez.

# feedback_greatTipDefault
source: Your tone matches the native speaker perfectly.
de: Dein Ton passt perfekt zum Muttersprachler.
fr: Votre ton correspond parfaitement au locuteur natif.

# feedback_goodStatus
source: Good start. Try to express more emotion.
de: Guter Anfang. Versuch mehr Emotionen auszudrücken.
fr: Bon début. Essayez d'exprimer plus d'émotion.

# feedback_goodTipQuestion
source: 💡 Tip: Raise your pitch more at the end of the question.
de: 💡 Tipp: Hebe die Stimme am Ende der Frage mehr an.
fr: 💡 Conseil : Montez plus le ton à la fin de la question.

# feedback_goodTipExclamation
source: 💡 Tip: Add more energy and emphasis on key words.
de: 💡 Tipp: Füge mehr Energie hinzu und betone Schlüsselwörter.
fr: 💡 Conseil : Mettez plus d'énergie et d'insistance sur les mots clés.

# feedback_goodTipDefault
source: 💡 Tip: Vary your pitch to sound less monotone.
de: 💡 Tipp: Variiere deinen Ton, um weniger monoton zu klingen.
fr: 💡 Conseil : Variez votre ton pour sonner moins monotone.

# feedback_flatStatus
source: Too flat. Mimic the ups and downs.
de: Zu flach. Imitiere das Auf und Ab.
fr: Trop plat. Imitez les montées et descentes.

# feedback_flatTipQuestion
source: 💡 Tip: Questions should rise at the end ↗️. Practice with exaggerated pitch.
de: 💡 Tipp: Fragen sollten am Ende ansteigen ↗️. Übe mit übertriebener Tonhöhe.
fr: 💡 Conseil : Les questions doivent monter à la fin ↗️. Pratiquez avec un ton exagéré.

# feedback_flatTipExclamation
source: 💡 Tip: Show excitement! Emphasize important words with higher pitch.
de: 💡 Tipp: Zeige Begeisterung! Betone wichtige Wörter mit höherer Tonlage.
fr: 💡 Conseil : Montrez de l'excitation ! Insistez sur les mots importants.

# feedback_flatTipDefault
source: 💡 Tip: Your voice sounds robotic. Copy the rhythm and melody of the native speaker.
de: 💡 Tipp: Deine Stimme klingt robotisch. Kopiere Rhythmus und Melodie des Muttersprachlers.
fr: 💡 Conseil : Votre voix sonne robotique. Copiez le rythme et la mélodie du natif.

# common_retry
source: Retry
de: Wiederholen
fr: Réessayer

# scenes_configureSession
source: Configure your practice session
de: Konfigurieren Sie Ihre Übungssitzung
fr: Configurez votre session

# study_pitchContour
source: Pitch Contour
de: Tonhöhenverlauf
fr: Courbe de Tonalité

# study_tapCurve
source: Tap curve
de: Kurve antippen
fr: Touchez la courbe

# study_pronunciation
source: Pronunciation
de: Aussprache
fr: Prononciation

# study_tapWords
source: Tap words
de: Wörter antippen
fr: Touchez les mots

# chat_deleteMessagesConfirm
source: Are you sure you want to delete selected messages? This action cannot be undone.
de: Möchten Sie die ausgewählten Nachrichten wirklich löschen? Dies kann nicht rückgängig gemacht werden.
fr: Voulez-vous supprimer les messages sélectionnés ? Impossible d'annuler.

# chat_textModeIcon
source: Text
fr: Texte

# feedback_grammarCorrect
source: Grammar is correct! Great expression!
de: Grammatik ist korrekt! Toller Ausdruck!
fr: La grammaire est correcte ! Superbe expression !

# feedback_pronunciationLabel
source: Pronunciation:
de: Aussprache:
fr: Prononciation :

# feedback_sentenceLabel
source: Sentence:
de: Satz:
fr: Phrase :

# onboarding_tellUsAboutYourself
source: Tell us about yourself
de: Erzählen Sie uns von sich
fr: Parlez-nous de vous

# onboarding_nativeLanguageQuestion
source: What is your native language?
de: Was ist Ihre Muttersprache?
fr: Quelle est votre langue maternelle ?

# onboarding_learningLanguageQuestion
source: What do you want to learn?
de: Was möchten Sie lernen?
fr: Que voulez-vous apprendre ?

# chat_suggestions
source: Suggestions
de: Vorschläge
